
# 1. Дано целое число. Если оно является положительным, то прибавить к нему 1; в противном случае не изменять его. Вывести полученное число.
# Даны три целых числа. Найти количество положительных чисел в исходном наборе.

# 2. Дан номер года (положительное целое число). Определить количество дней в этом году, учитывая, что обычный год насчитывает 365 дней, а високосный — 366
# дней. Високосным считается год, делящийся на 4, за исключением тех годов, которые делятся на 100 и не делятся на 400 (например, годы 300, 1300 и 1900 не являются
#високосными, а 1200 и 2000 являются).

# 3. Найти сумму всех натуральных чисел в от A до B

# 4. Найти произведение положительных, сумму и количество отрицательных из 10 введенных целых значений. (Функция ввода с клавиатуры - input())

# 5. Дано число N. Найти произведение всех чисел от 0 до N.

# 6. Поле засеяли цветами двух сортов на площади S1 и S2. Каждый год площадь цветов первого сорта увеличивается вдвое, а площадь второго сорта
# увеличивается втрое. Через сколько лет площадь первых сортов будет составлять меньше 10% от площади вторых сортов.

# 7. Напишите алгоритм для определения, является ли число n счастливым. Счастливое число определяется следующим процессом: 
# Начиная с любого положительного целого числа, замените число суммой квадратов его цифр. 
# Повторяйте процесс до тех пор, пока число не станет равным 1 (на этом значении оно и останется), или пока не замкнется в бесконечном цикле, не включающем 1.
# Числа, для которых этот процесс заканчивается на 1, являются счастливыми. Верните true, если n — счастливое число, и false, если нет.

# Example 1:
# Input: n = 19
# Output: true

# Explanation:
# 1**2 + 9**2 = 82
# 8**2 + 2**2 = 68
# 6**2 + 8**2 = 100
# 1**2 + 0**2 + 0**2 = 1
